uodate readme
